---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.ViewSolarstudySingledayDatetimeText
source: html/cd606a4d-7116-5f74-fe15-5ac615cffeef.htm
---
# Autodesk.Revit.DB.ParameterTypeId.ViewSolarstudySingledayDatetimeText Property

"Single day date and time text"

## Syntax (C#)
```csharp
public static ForgeTypeId ViewSolarstudySingledayDatetimeText { get; }
```